app/controllers/comments_controller.rb

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
---
  def index
     @post = Post.find(params[:post_id])

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
SELECT * FROM "comments" WHERE ("comments"."id" = 1 AND ("comments".post_id = 1))
---
  def show
     @post = Post.find(params[:post_id])
     @comment = @post.comments.find(params[:id])

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
---
  def new
    @post = Post.find(params[:post_id])

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
INSERT INTO "comments" ("created_at", "body", "updated_at", "post_id", "commenter") VALUES('2009-10-21 15:13:11', 'Here i have place my comment. I like the manner in which you explan all the methods used in your application.
---
  def create
     @post = Post.find(params[:post_id])
     @comment = @post.comments.new(params[:comment])

     if @comment.save