app/controllers/posts_controller.rb

SELECT * FROM "posts" WHERE ("posts"."published" = 't')
---
  def index
    if session[:user_id].nil? # if not logged in
    @posts = Post.all_published
    else
      @posts = Post.all.reverse

INSERT INTO "posts" ("created_at", "title", "body", "updated_at") VALUES('2009-10-20 18:25:43', 'Test', 'He warned that the issue could end up in the UN Security Council, and Niger could be left in international isolation unless Mr Tandja backed down.
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT * FROM "posts" WHERE ("posts"."id" = 2)
UPDATE "posts" SET "updated_at" = '2009-10-20 07:51:25', "body" = 'In my first learning dairy, i mentioned the following problems: i had prob-lems with most especially programming and i did not make a pass grade. i also had some problems with my jobs, i was for long hours every day and as a consequence, i was always tired. I did make mention of the fact that i considered the degree program easy and i was not taking my studies seri-ously and spent very little time studying. Let’s stop at these few. As early as the last semester ended, i made my resolution regarding my studies and life style. ' WHERE "id" = 2
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])